Revit 2024 API
Rebar.GetPresentationMode Method
 Gets the presentation mode for this rebar set when displayed in the given view.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public RebarPresentationMode GetPresentationMode(
	View dBView
)
Visual Basic
Public Function GetPresentationMode ( _
	dBView As View _
) As RebarPresentationMode
Visual C++
public:
RebarPresentationMode GetPresentationMode(
	View^ dBView
)
Parameters
dBView
Type: Autodesk.Revit.DB.View
 The view.
Return Value
 The presentation mode.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
Rebar Class
Autodesk.Revit.DB.Structure Namespace